In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
dict1={'Names':['Ram','sita','Laxman',np.nan],
      'Age':[30,31,np.nan,33],
      'City':[np.nan,'Hyd','Pune','chennai']}
pd.DataFrame(dict1)

    Names   Age     City
0     Ram  30.0      NaN
1    sita  31.0      Hyd
2  Laxman   NaN     Pune
3     NaN  33.0  chennai

In [5]:
dict1={'Names':['Ram','sita','Laxman',np.nan],
      'Age':[30,31,np.nan,33],
      'City':[np.nan,'Hyd','Pune','chennai']}
df=pd.DataFrame(dict1)
df

    Names   Age     City
0     Ram  30.0      NaN
1    sita  31.0      Hyd
2  Laxman   NaN     Pune
3     NaN  33.0  chennai

$ Method-1$

In [8]:
## Fill with random number to fill all NaN values
df.isnull()

   Names    Age   City
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False

In [10]:
df.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

In [20]:
df.isnull().count()  # it will not works

Names    4
Age      4
City     4
dtype: int64

In [22]:
df.isna()

   Names    Age   City
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False

## Note:
- isna() and isnull() is same

$ fillna$

In [40]:
df.fillna(40,
         inplace=True)

In [42]:
df

    Names   Age     City
0     Ram  30.0       40
1    sita  31.0      Hyd
2  Laxman  40.0     Pune
3      40  33.0  chennai

In [44]:
df.dtypes

Names     object
Age      float64
City      object
dtype: object

$ Method-2 $

In [ ]:
## Fill the random value by using column wise

In [82]:
dict1={'Names':['Ram','sita','Laxman',np.nan],
      'Age':[30,31,np.nan,33],
      'City':[np.nan,'Hyd','Pune','chennai']}
df=pd.DataFrame(dict1)
df

    Names   Age     City
0     Ram  30.0      NaN
1    sita  31.0      Hyd
2  Laxman   NaN     Pune
3     NaN  33.0  chennai

In [87]:
df["Names"].fillna("Nikesh",inplace=True)
df["Age"].fillna(40,inplace=True)
df["City"].fillna("Del",inplace=True)
df

C:\Users\pc\AppData\Local\Temp\ipykernel_18396\1002670814.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Names"].fillna("Nikesh",inplace=True)
C:\Users\pc\AppData\Local\Temp\ipykernel_18396\1002670814.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Age"].fillna(40,inplace=True)
C:\Users\pc\AppData\Local\Temp\ipykernel_18396\1002670814.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["City"].fillna("Del",inplace=True)

    Names   Age     City
0     Ram  30.0      Del
1    sita  31.0      Hyd
2  Laxman  40.0     Pune
3  Nikesh  33.0  chennai

$ Method-3$

- pad
- bfill
- backfill
- ffill

In [91]:
dict1={'Names':['Ram','sita','Laxman',np.nan],
      'Age':[30,31,np.nan,33],
      'City':[np.nan,'Hyd','Pune','chennai']}
df=pd.DataFrame(dict1)
df

    Names   Age     City
0     Ram  30.0      NaN
1    sita  31.0      Hyd
2  Laxman   NaN     Pune
3     NaN  33.0  chennai

In [123]:
print("============== original ========================")
print(df)

print("====================pad=======================")
print(df.fillna(method="pad"))

print("===================== bfill====================")
print(df.fillna(method="bfill"))

print("======================backfill=================")
print(df.fillna(method="backfill"))

print("=================== ffill ===============")
print(df.fillna(method="ffill"))

============== original ========================
    Names   Age     City
0     Ram  30.0      NaN
1    sita  31.0      Hyd
2  Laxman   NaN     Pune
3     NaN  33.0  chennai
====================pad=======================
    Names   Age     City
0     Ram  30.0      NaN
1    sita  31.0      Hyd
2  Laxman  31.0     Pune
3  Laxman  33.0  chennai
===================== bfill====================
    Names   Age     City
0     Ram  30.0      Hyd
1    sita  31.0      Hyd
2  Laxman  33.0     Pune
3     NaN  33.0  chennai
======================backfill=================
    Names   Age     City
0     Ram  30.0      Hyd
1    sita  31.0      Hyd
2  Laxman  33.0     Pune
3     NaN  33.0  chennai
=================== ffill ===============
    Names   Age     City
0     Ram  30.0      NaN
1    sita  31.0      Hyd
2  Laxman  31.0     Pune
3  Laxman  33.0  chennai

C:\Users\pc\AppData\Local\Temp\ipykernel_18396\93343821.py:5: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(df.fillna(method="pad"))
C:\Users\pc\AppData\Local\Temp\ipykernel_18396\93343821.py:8: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(df.fillna(method="bfill"))
C:\Users\pc\AppData\Local\Temp\ipykernel_18396\93343821.py:11: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(df.fillna(method="backfill"))
C:\Users\pc\AppData\Local\Temp\ipykernel_18396\93343821.py:14: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(df.fillna(method="ffill"))

In [125]:
print("============== original ========================")
print(df)

print("====================pad=======================")
print(df.fillna(method="pad",axis=1))

============== original ========================
    Names   Age     City
0     Ram  30.0      NaN
1    sita  31.0      Hyd
2  Laxman   NaN     Pune
3     NaN  33.0  chennai
====================pad=======================
    Names     Age     City
0     Ram    30.0     30.0
1    sita    31.0      Hyd
2  Laxman  Laxman     Pune
3     NaN    33.0  chennai

C:\Users\pc\AppData\Local\Temp\ipykernel_18396\1127692885.py:5: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(df.fillna(method="pad",axis=1))

### KMN imputer

## Method-4

- mean
- median
- mode

In [130]:
dict1={'Names':['Ram','sita','Laxman',np.nan],
      'Age':[30,31,np.nan,33],
      'City':[np.nan,'Hyd','Pune','chennai']}
df=pd.DataFrame(dict1)
df

    Names   Age     City
0     Ram  30.0      NaN
1    sita  31.0      Hyd
2  Laxman   NaN     Pune
3     NaN  33.0  chennai

In [132]:
# df['Age'].fillna(<mean>)
mean_age=np.mean(df['Age'])
df['Age'].fillna(mean_age)

0    30.000000
1    31.000000
2    31.333333
3    33.000000
Name: Age, dtype: float64

In [138]:
median_age=df['Age'].median()
df['Age'].fillna(median_age)

0    30.0
1    31.0
2    31.0
3    33.0
Name: Age, dtype: float64

- Mode is used for categorical data

- Mean and median is used for numerical data